In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'state' : ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
    'year' : [2000, 2001, 2002, 2001, 2002],
    'pop' : [1.5, 1.7, 3.6, 2.4, 2.9]
}

In [17]:
df = pd.DataFrame(data, columns=["year", "state", "pop", "Debt"], index = list('abcde'))

# df.columns = ["State", "Year", "Pop"]

In [18]:
# nan : not a number
# na : not available

In [19]:
df

   year   state  pop Debt
a  2000    Ohio  1.5  NaN
b  2001    Ohio  1.7  NaN
c  2002    Ohio  3.6  NaN
d  2001  Nevada  2.4  NaN
e  2002  Nevada  2.9  NaN

In [16]:
df['pop']

a    1.5
b    1.7
c    3.6
d    2.4
e    2.9
Name: pop, dtype: float64

## Nested dictionary : dictionary inside a dictionary

In [25]:
pop = {
    'Nevada' : {
        2001 : 2.9,
        2002 : 2.9
    },
    'Ohio' : {
        2002 : 3.6,
        2001 : 1.7,
        2000 : 1.5
    }
}

In [26]:
pop

{'Nevada': {2001: 2.9, 2002: 2.9}, 'Ohio': {2002: 3.6, 2001: 1.7, 2000: 1.5}}

In [27]:
# nevada and ohio will be treated as columns, and years (200, 2001, 2002) will be treated as indices

In [28]:
df2 = pd.DataFrame(pop)

In [29]:
df2

      Nevada  Ohio
2001     2.9   1.7
2002     2.9   3.6
2000     NaN   1.5

In [31]:
# transpose the dataframe

df2.T

        2001  2002  2000
Nevada   2.9   2.9   NaN
Ohio     1.7   3.6   1.5

In [32]:
df2

      Nevada  Ohio
2001     2.9   1.7
2002     2.9   3.6
2000     NaN   1.5

In [35]:
df2.index.name = "Year"
df2.columns.name = "State"

In [36]:
df2

State  Nevada  Ohio
Year
2001      2.9   1.7
2002      2.9   3.6
2000      NaN   1.5

In [37]:
df2.columns

Index(['Nevada', 'Ohio'], dtype='object', name='State')

In [38]:
df2.index

Index([2001, 2002, 2000], dtype='int64', name='Year')

In [39]:
df2.values

array([[2.9, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [40]:
df2['Nevada']

Year
2001    2.9
2002    2.9
2000    NaN
Name: Nevada, dtype: float64

In [41]:
df2

State  Nevada  Ohio
Year
2001      2.9   1.7
2002      2.9   3.6
2000      NaN   1.5

In [42]:
df

   year   state  pop Debt
a  2000    Ohio  1.5  NaN
b  2001    Ohio  1.7  NaN
c  2002    Ohio  3.6  NaN
d  2001  Nevada  2.4  NaN
e  2002  Nevada  2.9  NaN

In [45]:
df['Debt'] = [10, 20, 30, 40, 50]

In [46]:
df

   year   state  pop  Debt
a  2000    Ohio  1.5    10
b  2001    Ohio  1.7    20
c  2002    Ohio  3.6    30
d  2001  Nevada  2.4    40
e  2002  Nevada  2.9    50

In [47]:
del df['Debt']

In [48]:
df

   year   state  pop
a  2000    Ohio  1.5
b  2001    Ohio  1.7
c  2002    Ohio  3.6
d  2001  Nevada  2.4
e  2002  Nevada  2.9

In [51]:
df[df['year'] > 2001]

   year   state  pop
c  2002    Ohio  3.6
e  2002  Nevada  2.9

In [52]:
df

   year   state  pop
a  2000    Ohio  1.5
b  2001    Ohio  1.7
c  2002    Ohio  3.6
d  2001  Nevada  2.4
e  2002  Nevada  2.9

In [53]:
df[df['pop'] > 2]

   year   state  pop
c  2002    Ohio  3.6
d  2001  Nevada  2.4
e  2002  Nevada  2.9